# Brewfile - Homebrew package manager dependencies
#
# Install all packages: brew bundle install
# Update Brewfile:      brew bundle dump --force
# Cleanup unused:       brew bundle cleanup

# ============================================================================
# Taps
# ============================================================================
tap "oven-sh/bun"               # Bun JavaScript runtime

# ============================================================================
# Core Development Tools
# ============================================================================
brew "neovim"                    # Modern Vim-based editor
brew "git"                       # Version control (usually pre-installed)
brew "gh"                        # GitHub CLI

# ============================================================================
# Language Runtimes & Version Managers
# ============================================================================
brew "fnm"                       # Fast Node Manager (nvm alternative)
brew "pnpm"                      # Fast, disk space efficient package manager
brew "pyenv"                     # Python version manager
brew "pyenv-virtualenv"          # Python virtual environment manager
brew "poetry"                    # Python dependency management
brew "rbenv"                     # Ruby version manager
brew "go"                        # Go programming language
brew "bun"                       # Fast JavaScript runtime & toolkit

# ============================================================================
# Shell & Terminal Tools
# ============================================================================
brew "mosh"                      # Mobile shell (persistent SSH)
brew "tree"                      # Directory visualization
brew "fzf"                       # Fuzzy finder
brew "fd"                        # Modern find alternative
brew "wget"                      # HTTP/FTP file downloader

# ============================================================================
# Code Search & Analysis
# ============================================================================
brew "ast-grep"                  # AST-based code search
brew "ack"                       # Code search tool
brew "ripgrep"                   # Fast grep alternative (rg)

# ============================================================================
# Git Tools
# ============================================================================
brew "lazygit"                   # Terminal UI for git

# ============================================================================
# Documentation & Formatting
# ============================================================================
brew "mermaid-cli"               # Mermaid diagram generation
brew "luarocks"                  # Lua package manager (for Neovim plugins)

# ============================================================================
# Development Applications
# ============================================================================
cask "claude-code"               # Claude AI coding assistant CLI

# ============================================================================
# Cloud & Infrastructure
# ============================================================================
cask "gcloud-cli"                # Google Cloud Platform CLI
brew "flyctl"                    # Fly.io CLI
brew "bore-cli"                  # Modern alternative to ngrok for tunneling

# ============================================================================
# Optional - Fonts (uncomment if needed)
# ============================================================================
cask "font-fira-code"            # Fira Code font
cask "font-fira-code-nerd-font"  # Fira Code with Nerd Font icons
cask "font-meslo-lg-nerd-font"   # MesloLGS NF (recommended for p10k)

# ============================================================================
# Database Tools
# ============================================================================
brew "mysql-client"            # MySQL client (no server)
brew "postgresql"              # PostgreSQL (server not started by default)
brew "redis"                   # Redis (server not started by default)

# ============================================================================
# Optional - Other Tools
# ============================================================================
brew "fish"                    # Fish shell
brew "jq"                      # JSON processor
brew "yq"                      # YAML processor
brew "btop"                    # Modern resource monitor
brew "tmux"                    # Terminal multiplexer
brew "stow"                    # Symlink farm manager
